[
  {
    "id": "1765659470874",
    "title": "why behind writing",
    "content": "I wrote a substack post about writing a bit ago. I've been slow to post more of myself online. (this will be stream of consciousness) Writing is a thought transmitter. It's like I have a cup with a string, and there's another cup on the other end. Nobody may live at the other end. One day, somebody comes along, but they don't like what they hear. The next, another. This time, they sit a while and listen. They listen to understand, not to respond. What they hear is raw. Outside of meeting me in person, it's the rawest version of me. You could even argue it's even more intense than being with me in person. \r\n\r\nI write for myself, no doubt, but I also write for those who might enjoy living inside my thoughts for moments at a time, who might see something in themselves that they see in me. Henrik Karlsson's essay comes to mind. Publishing writing is a search query for finding friends, lovers, business partners, family. The simple truth here is writing scales. The magic of the printing press, turned digital. \r\n\r\nSo, in saying this, I intend to write more. Nay. I *will* write more. The only thing between the page and an audience is fear of judgement, invalidated by the realization that anybody you'd consider a friend would support what's best for you.",
    "type": "note",
    "date": "2025-12-13T20:57:50.875Z"
  },
  {
    "id": "1765660841254",
    "title": "life without smartphones (of course)",
    "content": "Mark, Will and I spoke yesterday evening about many things, one of which was life without smartphones. \r\n\r\nFor efficiency's sake, the personal device is superior. One size fits all, or all sizes fit one. \r\n\r\nInstant gratifarm. Newly coined, by me. Tim Urban wrote extensively about this a long time ago. Since then, many others have too. The idea that smartphones are instant gratification spirals is shared now, probably amongst the general population, but few take actions against.  \r\n\r\nShort form has ruined the phone. If you didn't think we lived in an attention economy before it, we most certainly do now. I'm not here to argue that every waking hour of the day needs to be juiced of its productivity. But short form video has gone much to far in the mindshare of not just western civilization, but the entire human species. \r\n\r\nInstant gratifarm is everything it sounds. The hours you spent on your phone that make you go *what the fuck am I doing with my time* when your weekly screen time notification pops up. \r\n\r\nI'm curious- we can all agree that too much screen time and too much short form video ingestion is *bad*, but is anybody making sincere efforts to combat it? It's one of a few agreed upon problems that an underwhelming minority are working on solutions for. What are some others?",
    "type": "note",
    "date": "2025-12-13T21:20:41.254Z"
  },
  {
    "id": "1765661331040",
    "title": "mindshare",
    "content": "If we had a company leaderboard for which employee dominated any given week's mindshare, I would've taken it this week. On a small scale, I beared the fruits of months of labor in the shape of a few viral moments at the office. The company's youngest employee, a sales guy, showing off his technical ability for all to see. Then, a masterclass on seeding prospects over instagram DM that impressed the team. Friday morning's unexpected shoutout for cosplaying janitor for an hour proved a cherry on top. \r\n\r\nYou have more and more of these moments and you really begin to understand the overnight success, the \"I wasn't familiar with your game\" type moments. Speaking of, I just opened slack to a new message:\r\n\r\nSaturday at 4:22pm: \"was super fun to hang. watching what you built for the AI hackathon my immediate thought was \"this guy is going places\". keep up the hard work. it shows!!\r\n\r\nIt's extremely validating + gratifying to be recognized, especially among a number of peers I hold in high regard. Celebrate it, and use it as fuel. Weeks like these bring me closer to what I already know- I am an extraordinary person.",
    "type": "note",
    "date": "2025-12-13T21:28:51.040Z"
  },
  {
    "id": "1765662066159",
    "title": "romanticizing",
    "content": "What is life without the ability to romanticize; to dream; to manifest and then to believe. \r\n\r\nYou've heard the adage- if you put your mind to it, you can accomplish anything. (Marty Mcfly? great movie). I find such joy in romanticizing- right now I'm romanticizing what it must be like atop the Himalayas, listening as the flute's air tickles your eardrums, as I sit in my apartment in the east village of new york, preparing for a sociable saturday evening. \r\n\r\nThis music transports me to another land, to another corner of the world, unbeknownst to me. \r\nI want to chase this feeling, I know I do. The more I listen to the flute, the more I desire it. To be closer, to one day hear it in person. I dream of faraway lands, untravelled and untarnished. And that dream is alive.\r\n\r\nI fear turning that dream a reality. When one's peers hold an experience with such prestige, as such a dinner at four charles, does real thing ever stand a chance? Some dreams deserve to be realized, others are better kept dreamt.",
    "type": "note",
    "date": "2025-12-13T21:41:06.159Z"
  },
  {
    "id": "1765669554259",
    "title": "website ideas",
    "content": "this website should be simple and elegant yet playful. im trying to think of things that i'd want to have on here that i've accumulated over time, that I'd be excited to connect with folks about. right now- in my vibecoding era- I want folks doing the same, spending time learning the ins and outs. \r\n\r\nI've heard it said time and time again over recent months, but it really is just about agency paired with a little bit of know-how. becomes a work ethic game, a game which I'm confident I will win at. I want to get to know people who are plugged into the same spaces as me, like Max, Frankel, Daniel, and many more. \r\n\r\nthis website's goal- as mentioned previously- is to attract folks with overlapping ambitions and interests, going through a similar journey, perhaps looking for friends to do life with alongside themselves. \r\n\r\nAll is to say, I want a website that represents *me*.. that looks like:\r\n\r\n- fun mini features here and there, like the paper shaders spirals, or liquid floating around, or other surprise and delight moments that are fun to build and fun to have. little \"moments\"\r\n- references- things i like to consume- reading, writing, design, socially, \r\n     - hobbies likely live inside here... tennis, running? exploring new neighborhoods, versatile fashion, good interior design, perhaps something older with character, renovating a french villa, living with or near friends at all costs, harmonica, yoga, saihoji\r\n- values I uphold and would love to see other people who do\r\n- projects i've worked on in the past? websites? \r\n     - senior art thesis; new years gala / houseburning sites; short film; asia for three months; \r\n\r\nthe site could have fun different loading pages\r\n\r\none is the sound of the himalayan flute with a photo scanned from the saihoji book, with the pitter patter of rain on the leaves. \r\n\r\nanother is the country in copenhagen with friends and family, loving life\r\n\r\nlet's start with the japanese temple in the rain and go from there. it will have to be a 4k image, and we'll have to figure out the right way to make it feel right. \r\n\r\nwe could have a 'transport me' button and it takes you to different parts of the world i love to spend time in\r\n- la banchina\r\n- saihoji\r\n- the fountain in paris\r\n- the beach in ios\r\n- the blue ridge mountain hikes \r\n- home in new england, or the beach on the cape \r\n\r\nthese are all fun add on ideas, but we should build the core functionality first. In past builds, I've gotten caught up in the fun features and never dedicated enough time to the foundational build.",
    "type": "note",
    "date": "2025-12-13T23:45:54.259Z"
  }
]